Revit 2027 API
View.Print(View) Method
Print this view with the given view template and using the print setting of the current active document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Print(
	View viewTemplate
)
Public Sub Print (
	viewTemplate As View
)
public:
void Print(
	View^ viewTemplate
)
member Print :
        viewTemplate : View -> unit
Parameters
viewTemplate View
The view template which apply to the view.
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the view cannot be printed.
See Also
Reference
View Class
Print Overload
Autodesk.Revit.DB Namespace